package com.ruihuo.ixungen.entity;

/**
 * @author yudonghui
 * @date 2017/3/28
 * @describe May the Buddha bless bug-free!!!
 */
public class ArticleDetailBean {

    /**
     * code : 0
     * msg : success
     * data : {"id":"49","rid":"0","author":"","title":"中国历史上的移民发源地之二\u2014\u2014江西瓦屑坝","summary":"1991年一个温暖的冬天，我们由安庆去桐城。路上停车用餐后，信步走出饭店，见一位60来岁的老人正在翻晒棉秸。闲聊中问他：\u201d您是本地人吧?\u201d\u201c是呀。\u201d\u201c您的老祖宗是从什么地方来的呢?\u201d\u201c哦，老祖宗..是从江西来的 ...","content":"<div style=\"text-align: center;\"><p><a href=\"data/attachment/portal/201604/13/114333cbn7zb8b4oj89fqo.jpg\" target=\"_blank\"><img src=\"data/attachment/portal/201604/13/114333cbn7zb8b4oj89fqo.jpg\"><\/a><\/p><\/div><div><br><\/div><div>1991年一个温暖的冬天，我们由安庆去桐城。路上停车用餐后，信步走出饭店，见一位60来岁的老人正在翻晒棉秸。闲聊中问他：\u201d您是本地人吧?\u201d\u201c是呀。\u201d\u201c您的老祖宗是从什么地方来的呢?\u201d\u201c哦，老祖宗..是从江西来的。\u201d\u201c是江西瓦屑坝吗?\u201d\u201c是呀!你怎么知道?\u201d老人激动起来，\u201d我们这里的人差不多都是从瓦屑坝迁来的，不单是我们村，前前后后的村庄都是瓦屑坝老祖宗的后代。\u201d\u201c您是怎么知道的呢?\u201d\u201c这里谁不知道？从小就听老辈说的嘛。族谱上也写得清清楚楚。\u201d像其他实例一样，老人的话证实了我们根据文献资料得出的结论：桐城、宿松、潜山、怀宁等安庆市的属县中有很多人是瓦屑坝移民的后裔。<\/div><div><br><\/div><div>江淮大地处于中国南北相交之地，在分裂时期往往沦为战场。1127年金灭北宋后，江淮之间既是金军南侵的必经之地，又是靠近宋金对峙的前沿，原有人口或随南迁洪流而走，或在战乱中死亡，留下的人数有限，新迁入的更少。安庆府所属的淮南西路，在整个南宋都是人口最稀少的地区之一，以至在元朝数十年间也没有恢复元气。<\/div><div><br><\/div><div>元朝末年，江淮和长江中游反元起义风起云涌，此起彼伏。安庆一带战略地位重要，是不同的起义军和元军争夺的焦点，残酷的争夺战持续多年。元至正十一年(1351)八月，彭莹玉、邹普胜、徐寿辉等在湖北蕲州、黄州一带起义，次年徐寿辉就率部沿江而下，围安庆城，攻下周围各县，并继续东下。十一月，徐寿辉大举攻安庆城，无功而返。至正十五年，徐寿辉势力复振，攻占湖北沿江府县，安庆府又受战祸波及。次年，余阙被元朝任命为江淮行省参政，驻守安庆，徐寿辉部将赵普胜攻安庆失利。至正十七年，朱元璋部四出扩展，击败赵普胜和元军，占据江南的池州(今贵池地区)，逼近安庆。陈友谅与赵普胜率军包围安庆。至正十八年，陈、赵军攻克安庆，余阙自杀。四月，赵普胜夺取朱元璋占据的池州府。至正十九年，朱元璋军西进，与陈友谅军激战，四月收复池州，九月破潜山，十月攻安庆不克。二十年，陈友谅杀徐寿辉后称汉帝，率水军东下攻朱元璋的基地建康(今南京)，大败而归，朱元璋军乘势攻下安庆。二十一年七月，陈友谅将张定边攻陷安庆。八月，朱元璋亲率徐达、常遇春西征，收复安庆。但江西、湖北大多还是陈友谅属地，安庆以北也非朱元璋所有，安庆一带并未脱离战祸，直到至正二十四年(1364)朱元璋彻底消灭陈友谅余部后才恢复安宁。<\/div><div><br><\/div><div>十几年间，安庆多次易帜，在旧政权维持无望、新政权统一尚未来临之时，争夺的各方都不会顾及百姓的生命财产和地方的长远利益，残酷的报复和仇杀、毁灭性的破坏和掠夺在所难免，安庆及府属各县遭受的浩劫可想而知。到朱元璋刀枪入库、马放南山时，安庆府留下的人口已少得可怜，大片土地只能任其荒芜。<\/div><div><br><\/div><div>相比之下，相距仅数百里的江西饶州路(约相当今波阳、余干、万年、乐平、德兴、景德镇、浮梁等市县，元属江浙行省)较少受战乱影响，依然地少人多。明初政府鼓励向江淮和其他人口稀少地区移民，外来移民开垦的土地不仅能合法登记为私有财产，还能在一定期限内享受赋税优惠。饶州路的大量无地贫民纷纷北迁，当到达安庆府属各县后，大片宜垦荒地和与家乡大致相同的自然环境很快就吸引他们就地定居。消息传到故乡，又促使更多的饶州人加入了移民的行列。江西其他地区渡江北迁的移民，也被安庆地区的条件所吸引而就近定居。<\/div><div><br><\/div><div>有关明初江西移民迁入安庆和定居的史实，在官方的史书中几乎没有什么记载，主要原因不外乎两点：第一，安庆与饶州相距不远，一旦在人口和土地比例上出现如此强烈的反差，就必然会出现自发的人口迁移，政府的优惠政策对抚州人已经具有足够的吸引力，根本不需要再采取什么特殊政策，更不必加以强制。第二，与明初大规模的移民运动相比，从饶州迁往安庆，无论从距离还是数量来说，都算不上重大或突出。<\/div><div><br><\/div><div>但在当地，在移民家族和后裔的心目中，这次迁移是永远值得纪念的大事。正因为如此，在地方志和族谱中，我们还是可以找到不少证据。<\/div><div><br><\/div><div>清康熙年间官居大学士的张英，是桐城人。他说：\u201c吾桐(城)与潜(山)同郡而接壤，相距百里许。余之先自鄱阳瓦屑坝徙于桐，始祖为贵四公。潜亦同时同地并来鄱阳，始祖为贵七公，徙居于潜之青山焉。\u201d(康熙《潜山县志》卷十四)清初宿松人朱书也说：\u201c吾安庆，..神明之奥区，人物之渊薮也。然元以后至今，皖人非古皖人也，强半徙自江西，其徙自他省会者错焉，土著才十一二耳。\u201d(《杜溪文集》卷三)<\/div><div><br><\/div><div>根据族谱记载所作的统计分析，证明张英和朱书的说法是可信的，张英的祖先张贵四、张贵七正是千千万万饶州移民中的成员。有人统计了桐城县的63种族谱，其中有20%的家族的始祖来自江西鄱阳瓦屑坝，其余也大多是在元末明初由江西迁来。而元末以前的家族只有两个--方氏和姚氏，分别在宋代和元中期迁入。我们对安徽省图书馆、安徽省博物馆和安庆市图书馆所藏36种族谱的统计结果是：迁自瓦屑坝和鄱阳县的家族有18个，占50%；迁自饶州和江西的合计有26个，占72%。从迁入的时间看，除了迁入时间不详的4族和明以后迁入的3族外，在29族中有27族是元末明初迁入的，占93%。<\/div><div><br><\/div><div>宿松县的情况也是如此。民国《宿松县志》记载了该县256个氏族，除去迁入时间和原籍不详的外，尚有213族，其中182族是明中期以前迁入的。在这182族中，迁自江西饶州的有82族，占总数的45%；在元末明初迁入的有143族，占88%。在元末明初迁入的143族中，迁自江西的有116族，占83%；其中有38族明确记载来自瓦屑坝，31族来自饶州或鄱阳县，其余来自九江、南昌、南康、吉安或\u201c江西\u201d、\u201c江右\u201d。<\/div><div><br><\/div><div>根据这样的推算，在明洪武二十四年(1391)安庆府的约42万人口中，大约有28万多江西移民，其中约20万来自饶州，迁自瓦屑坝的有10万人，占饶州籍移民的一半。6个世纪过去了，这10万瓦屑坝人的子孙已经植根在江淮大地，成为安庆人的重要组成部分。<\/div><div><br><\/div><div>瓦屑坝，族谱中有\u201c江西瓦屑坝\u201d、\u201c鄱阳瓦屑坝\u201d、\u201c鄱阳桃花渡瓦屑坝\u201d、\u201c瓦屑坝叶家村金鸡岭\u201d等不同的写法，肯定在鄱阳(今作波阳)县。但岁月流逝，瓦屑坝消失在历史的长河中，而今的波阳县地图上已经找不到这个地名了。<\/div><div><br><\/div><div>我们把目光注视到今波阳县城西面一个叫\u201c瓦燮坽\u201d的村庄，果然在该村现存的《朱氏族谱》和《何氏族谱》中明确记载着\u201c瓦燮\u201d就是\u201c瓦屑\u201d的雅称。\u201c瓦燮坽\u201d就是元末明初的\u201c瓦屑坝\u201d。<\/div><div><br><\/div><div>瓦燮今属莲湖乡，离波阳县城鄱阳镇(即当年饶州府治)不过一二十里，处于鄱江三角洲，离鄱阳湖的汊湖大莲子湖不过十来里，周围湖泊密布，水路通畅。根据历史地理学家的研究，在宋代鄱阳县城已逼近鄱阳湖，而鄱阳湖的南部在元明时期正经历一个扩展期，到清代才逐渐因泥沙淤积而有所缩小。所以可以断定，当年的瓦屑坝是一个濒临鄱阳湖、靠近鄱江的聚落和水运码头。瓦屑坝的\u201c坝\u201d应该是鄱阳湖边的一条坝，真正起着护岸作用的坝，聚落因坝而得名。时过境迁，由于泥沙淤积，鄱阳湖逐渐远离瓦屑坝，坝因不再有存在的意义而湮没，瓦屑坝这个聚落名称也被改称为\u201c瓦燮坽\u201d。值得注意的是，在这个濒湖县中已找不到带\u201c坝\u201d字的地名，说明防止陆地陷湖和湖水的漫溢冲蚀早已成为历史。<\/div><div><br><\/div><div>遥想当年，饶州府属各县的外迁人口沿昌江、乐安河(婺水)及其众多的支流顺流而下，出饶州府城后，在鄱阳湖边的瓦屑坝集中，然后登舟北上。到达湖口后，多数人就近在安庆府属各县定居，少数人或溯长江而上，迁入湖广(今湖北省)，或顺长江而下，迁往安徽及其他省份。迁入安庆府的20万饶州移民多数是从瓦屑坝出发的，加上迁往安徽其他地区和湖广的移民，二三十年间瓦屑坝至少输出了30万饶州人。<\/div><div><br><\/div><div>虽然瓦屑坝只是一个移民的集散地，对绝大多数移民来说，还不是他们真正的故乡，但当年的移民多数没有文化、没有资产，更不可能有文字记录，当他们历尽艰辛在他乡定居后，留给后代的记忆只是他们的出发地--瓦屑坝。有些人甚至没有来得及给子孙留下任何故乡的信息，他们的后裔就与周围的移民后裔一样，以瓦屑坝为故乡了。<\/div><div><br><\/div><div>鄱阳瓦屑坝，已是安庆地区和其他地区饶州移民后裔一致认同的根。&nbsp;<\/div><div><br><\/div><div>安庆很多姓的宗谱也都记载着本族来自江西瓦屑坝，也无人知道瓦屑坝何在？２０００年３月１日《安庆日报\u2022下午版》有一篇《瓦屑坝\u2014安庆人的根》的文章，是上海复旦大学历史研究所所长葛剑雄教授所撰，文章指出元代江西饶州路约相当于今日之波阳、余干、万年、乐平、德兴、景德镇、浮梁等市县，属江浙行省。鄱阳县就是现在的波阳县，那里有一个叫瓦燮坽的地方，那就是瓦屑坝。５月１０日署名共水的作者也在该报发表了实地考察文章\u2015\u2015《走近瓦屑坝》。文章说：当地方言叫\u201c瓦屑朗\u201d。并附了一张妇女在坝底拾瓦砾的照片，一张几人合抱粗的老樟树的照片，他分析说该处可能就是当年人们离开这里的码头。<\/div>","picurl":"http://www.ixungen.cn/data/attachment/forum/201702/08/095445pk9xv82x9v79vg9n.jpg","count":"7","create_time":"1460439720","status":"3"}
     * serverTime : 2017-03-29 14:22:47
     */

    private int code;
    private String msg;
    private DataBean data;
    private String serverTime;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public String getServerTime() {
        return serverTime;
    }

    public void setServerTime(String serverTime) {
        this.serverTime = serverTime;
    }

    public static class DataBean {
        /**
         * id : 49
         * rid : 0
         * author :
         * title : 中国历史上的移民发源地之二——江西瓦屑坝
         * summary : 1991年一个温暖的冬天，我们由安庆去桐城。路上停车用餐后，信步走出饭店，见一位60来岁的老人正在翻晒棉秸。闲聊中问他：”您是本地人吧?”“是呀。”“您的老祖宗是从什么地方来的呢?”“哦，老祖宗..是从江西来的 ...
         * content : <div style="text-align: center;"><p><a href="data/attachment/portal/201604/13/114333cbn7zb8b4oj89fqo.jpg" target="_blank"><img src="data/attachment/portal/201604/13/114333cbn7zb8b4oj89fqo.jpg"></a></p></div><div><br></div><div>1991年一个温暖的冬天，我们由安庆去桐城。路上停车用餐后，信步走出饭店，见一位60来岁的老人正在翻晒棉秸。闲聊中问他：”您是本地人吧?”“是呀。”“您的老祖宗是从什么地方来的呢?”“哦，老祖宗..是从江西来的。”“是江西瓦屑坝吗?”“是呀!你怎么知道?”老人激动起来，”我们这里的人差不多都是从瓦屑坝迁来的，不单是我们村，前前后后的村庄都是瓦屑坝老祖宗的后代。”“您是怎么知道的呢?”“这里谁不知道？从小就听老辈说的嘛。族谱上也写得清清楚楚。”像其他实例一样，老人的话证实了我们根据文献资料得出的结论：桐城、宿松、潜山、怀宁等安庆市的属县中有很多人是瓦屑坝移民的后裔。</div><div><br></div><div>江淮大地处于中国南北相交之地，在分裂时期往往沦为战场。1127年金灭北宋后，江淮之间既是金军南侵的必经之地，又是靠近宋金对峙的前沿，原有人口或随南迁洪流而走，或在战乱中死亡，留下的人数有限，新迁入的更少。安庆府所属的淮南西路，在整个南宋都是人口最稀少的地区之一，以至在元朝数十年间也没有恢复元气。</div><div><br></div><div>元朝末年，江淮和长江中游反元起义风起云涌，此起彼伏。安庆一带战略地位重要，是不同的起义军和元军争夺的焦点，残酷的争夺战持续多年。元至正十一年(1351)八月，彭莹玉、邹普胜、徐寿辉等在湖北蕲州、黄州一带起义，次年徐寿辉就率部沿江而下，围安庆城，攻下周围各县，并继续东下。十一月，徐寿辉大举攻安庆城，无功而返。至正十五年，徐寿辉势力复振，攻占湖北沿江府县，安庆府又受战祸波及。次年，余阙被元朝任命为江淮行省参政，驻守安庆，徐寿辉部将赵普胜攻安庆失利。至正十七年，朱元璋部四出扩展，击败赵普胜和元军，占据江南的池州(今贵池地区)，逼近安庆。陈友谅与赵普胜率军包围安庆。至正十八年，陈、赵军攻克安庆，余阙自杀。四月，赵普胜夺取朱元璋占据的池州府。至正十九年，朱元璋军西进，与陈友谅军激战，四月收复池州，九月破潜山，十月攻安庆不克。二十年，陈友谅杀徐寿辉后称汉帝，率水军东下攻朱元璋的基地建康(今南京)，大败而归，朱元璋军乘势攻下安庆。二十一年七月，陈友谅将张定边攻陷安庆。八月，朱元璋亲率徐达、常遇春西征，收复安庆。但江西、湖北大多还是陈友谅属地，安庆以北也非朱元璋所有，安庆一带并未脱离战祸，直到至正二十四年(1364)朱元璋彻底消灭陈友谅余部后才恢复安宁。</div><div><br></div><div>十几年间，安庆多次易帜，在旧政权维持无望、新政权统一尚未来临之时，争夺的各方都不会顾及百姓的生命财产和地方的长远利益，残酷的报复和仇杀、毁灭性的破坏和掠夺在所难免，安庆及府属各县遭受的浩劫可想而知。到朱元璋刀枪入库、马放南山时，安庆府留下的人口已少得可怜，大片土地只能任其荒芜。</div><div><br></div><div>相比之下，相距仅数百里的江西饶州路(约相当今波阳、余干、万年、乐平、德兴、景德镇、浮梁等市县，元属江浙行省)较少受战乱影响，依然地少人多。明初政府鼓励向江淮和其他人口稀少地区移民，外来移民开垦的土地不仅能合法登记为私有财产，还能在一定期限内享受赋税优惠。饶州路的大量无地贫民纷纷北迁，当到达安庆府属各县后，大片宜垦荒地和与家乡大致相同的自然环境很快就吸引他们就地定居。消息传到故乡，又促使更多的饶州人加入了移民的行列。江西其他地区渡江北迁的移民，也被安庆地区的条件所吸引而就近定居。</div><div><br></div><div>有关明初江西移民迁入安庆和定居的史实，在官方的史书中几乎没有什么记载，主要原因不外乎两点：第一，安庆与饶州相距不远，一旦在人口和土地比例上出现如此强烈的反差，就必然会出现自发的人口迁移，政府的优惠政策对抚州人已经具有足够的吸引力，根本不需要再采取什么特殊政策，更不必加以强制。第二，与明初大规模的移民运动相比，从饶州迁往安庆，无论从距离还是数量来说，都算不上重大或突出。</div><div><br></div><div>但在当地，在移民家族和后裔的心目中，这次迁移是永远值得纪念的大事。正因为如此，在地方志和族谱中，我们还是可以找到不少证据。</div><div><br></div><div>清康熙年间官居大学士的张英，是桐城人。他说：“吾桐(城)与潜(山)同郡而接壤，相距百里许。余之先自鄱阳瓦屑坝徙于桐，始祖为贵四公。潜亦同时同地并来鄱阳，始祖为贵七公，徙居于潜之青山焉。”(康熙《潜山县志》卷十四)清初宿松人朱书也说：“吾安庆，..神明之奥区，人物之渊薮也。然元以后至今，皖人非古皖人也，强半徙自江西，其徙自他省会者错焉，土著才十一二耳。”(《杜溪文集》卷三)</div><div><br></div><div>根据族谱记载所作的统计分析，证明张英和朱书的说法是可信的，张英的祖先张贵四、张贵七正是千千万万饶州移民中的成员。有人统计了桐城县的63种族谱，其中有20%的家族的始祖来自江西鄱阳瓦屑坝，其余也大多是在元末明初由江西迁来。而元末以前的家族只有两个--方氏和姚氏，分别在宋代和元中期迁入。我们对安徽省图书馆、安徽省博物馆和安庆市图书馆所藏36种族谱的统计结果是：迁自瓦屑坝和鄱阳县的家族有18个，占50%；迁自饶州和江西的合计有26个，占72%。从迁入的时间看，除了迁入时间不详的4族和明以后迁入的3族外，在29族中有27族是元末明初迁入的，占93%。</div><div><br></div><div>宿松县的情况也是如此。民国《宿松县志》记载了该县256个氏族，除去迁入时间和原籍不详的外，尚有213族，其中182族是明中期以前迁入的。在这182族中，迁自江西饶州的有82族，占总数的45%；在元末明初迁入的有143族，占88%。在元末明初迁入的143族中，迁自江西的有116族，占83%；其中有38族明确记载来自瓦屑坝，31族来自饶州或鄱阳县，其余来自九江、南昌、南康、吉安或“江西”、“江右”。</div><div><br></div><div>根据这样的推算，在明洪武二十四年(1391)安庆府的约42万人口中，大约有28万多江西移民，其中约20万来自饶州，迁自瓦屑坝的有10万人，占饶州籍移民的一半。6个世纪过去了，这10万瓦屑坝人的子孙已经植根在江淮大地，成为安庆人的重要组成部分。</div><div><br></div><div>瓦屑坝，族谱中有“江西瓦屑坝”、“鄱阳瓦屑坝”、“鄱阳桃花渡瓦屑坝”、“瓦屑坝叶家村金鸡岭”等不同的写法，肯定在鄱阳(今作波阳)县。但岁月流逝，瓦屑坝消失在历史的长河中，而今的波阳县地图上已经找不到这个地名了。</div><div><br></div><div>我们把目光注视到今波阳县城西面一个叫“瓦燮坽”的村庄，果然在该村现存的《朱氏族谱》和《何氏族谱》中明确记载着“瓦燮”就是“瓦屑”的雅称。“瓦燮坽”就是元末明初的“瓦屑坝”。</div><div><br></div><div>瓦燮今属莲湖乡，离波阳县城鄱阳镇(即当年饶州府治)不过一二十里，处于鄱江三角洲，离鄱阳湖的汊湖大莲子湖不过十来里，周围湖泊密布，水路通畅。根据历史地理学家的研究，在宋代鄱阳县城已逼近鄱阳湖，而鄱阳湖的南部在元明时期正经历一个扩展期，到清代才逐渐因泥沙淤积而有所缩小。所以可以断定，当年的瓦屑坝是一个濒临鄱阳湖、靠近鄱江的聚落和水运码头。瓦屑坝的“坝”应该是鄱阳湖边的一条坝，真正起着护岸作用的坝，聚落因坝而得名。时过境迁，由于泥沙淤积，鄱阳湖逐渐远离瓦屑坝，坝因不再有存在的意义而湮没，瓦屑坝这个聚落名称也被改称为“瓦燮坽”。值得注意的是，在这个濒湖县中已找不到带“坝”字的地名，说明防止陆地陷湖和湖水的漫溢冲蚀早已成为历史。</div><div><br></div><div>遥想当年，饶州府属各县的外迁人口沿昌江、乐安河(婺水)及其众多的支流顺流而下，出饶州府城后，在鄱阳湖边的瓦屑坝集中，然后登舟北上。到达湖口后，多数人就近在安庆府属各县定居，少数人或溯长江而上，迁入湖广(今湖北省)，或顺长江而下，迁往安徽及其他省份。迁入安庆府的20万饶州移民多数是从瓦屑坝出发的，加上迁往安徽其他地区和湖广的移民，二三十年间瓦屑坝至少输出了30万饶州人。</div><div><br></div><div>虽然瓦屑坝只是一个移民的集散地，对绝大多数移民来说，还不是他们真正的故乡，但当年的移民多数没有文化、没有资产，更不可能有文字记录，当他们历尽艰辛在他乡定居后，留给后代的记忆只是他们的出发地--瓦屑坝。有些人甚至没有来得及给子孙留下任何故乡的信息，他们的后裔就与周围的移民后裔一样，以瓦屑坝为故乡了。</div><div><br></div><div>鄱阳瓦屑坝，已是安庆地区和其他地区饶州移民后裔一致认同的根。&nbsp;</div><div><br></div><div>安庆很多姓的宗谱也都记载着本族来自江西瓦屑坝，也无人知道瓦屑坝何在？２０００年３月１日《安庆日报•下午版》有一篇《瓦屑坝—安庆人的根》的文章，是上海复旦大学历史研究所所长葛剑雄教授所撰，文章指出元代江西饶州路约相当于今日之波阳、余干、万年、乐平、德兴、景德镇、浮梁等市县，属江浙行省。鄱阳县就是现在的波阳县，那里有一个叫瓦燮坽的地方，那就是瓦屑坝。５月１０日署名共水的作者也在该报发表了实地考察文章――《走近瓦屑坝》。文章说：当地方言叫“瓦屑朗”。并附了一张妇女在坝底拾瓦砾的照片，一张几人合抱粗的老樟树的照片，他分析说该处可能就是当年人们离开这里的码头。</div>
         * picurl : http://www.ixungen.cn/data/attachment/forum/201702/08/095445pk9xv82x9v79vg9n.jpg
         * count : 7
         * create_time : 1460439720
         * status : 3
         */

        private String id;
        private String rid;
        private String author;
        private String title;
        private String summary;
        private String content;
        private String picurl;
        private String count;
        private String create_time;
        private String status;

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }

        public String getRid() {
            return rid;
        }

        public void setRid(String rid) {
            this.rid = rid;
        }

        public String getAuthor() {
            return author;
        }

        public void setAuthor(String author) {
            this.author = author;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getSummary() {
            return summary;
        }

        public void setSummary(String summary) {
            this.summary = summary;
        }

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }

        public String getPicurl() {
            return picurl;
        }

        public void setPicurl(String picurl) {
            this.picurl = picurl;
        }

        public String getCount() {
            return count;
        }

        public void setCount(String count) {
            this.count = count;
        }

        public String getCreate_time() {
            return create_time;
        }

        public void setCreate_time(String create_time) {
            this.create_time = create_time;
        }

        public String getStatus() {
            return status;
        }

        public void setStatus(String status) {
            this.status = status;
        }
    }
}
